Repository: cinmou/micaGO
Catalog: MicaGoServer/micago-mac-companion/MicaGoCompanion/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

source: Starting server…
zh_hans: 正在启动服务器…
zh_hant: 正在啟動伺服器…

source: Starting…
zh_hans: 正在启动…
zh_hant: 正在啟動…

source: State
zh_hans: 状态
zh_hant: 狀態

source: Status
zh_hans: 状态
zh_hant: 狀態

source: Status: %@
zh_hans: 状态：%@
zh_hant: 狀態：%@

source: Stop
zh_hans: 停止
zh_hant: 停止

source: Stop server
zh_hans: 停止服务器
zh_hant: 停止伺服器

source: Stop tunnel when the server stops
zh_hans: 服务器停止时停止隧道
zh_hant: 伺服器停止時停止通道

source: Stopped
zh_hans: 已停止
zh_hant: 已停止

source: Stopped after %lld crashes. Start it manually.
zh_hans: 连续崩溃 %lld 次后已停止，请手动启动。
zh_hant: 連續當機 %lld 次後已停止，請手動啟動。

source: Stopping server…
zh_hans: 正在停止服务器…
zh_hant: 正在停止伺服器…

source: Stopping…
zh_hans: 正在停止…
zh_hant: 正在停止…

source: Stub
zh_hans: 占位
zh_hant: 預留

source: Sync
zh_hans: 同步
zh_hant: 同步

source: Sync public URL to Firestore (optional)
zh_hans: 把公网 URL 同步到 Firestore（可选）
zh_hant: 把公開 URL 同步到 Firestore（選用）

source: Test Contact
zh_hans: 测试联系人
zh_hant: 測試聯絡人

source: Text
zh_hans: 文本
zh_hant: 文字

source: The Android app uses this file to set up Firebase.
zh_hans: 安卓 App 用这个文件设置 Firebase。
zh_hant: Android App 用這個檔案設定 Firebase。

source: The IMCore helper is ready. Edit, Unsend, and Delete are available.
zh_hans: IMCore 助手已就绪，可以编辑、撤回和删除。
zh_hant: IMCore 輔助程式已就緒，可以編輯、收回和刪除。

source: The address devices on the same Wi‑Fi use to connect. Hide VPN or virtual addresses so they aren’t offered for pairing.
zh_hans: 同一 Wi‑Fi 下的设备用这个地址连接。隐藏 VPN 或虚拟地址，免得配对时出现它们。
zh_hant: 同一 Wi‑Fi 下的裝置用這個位址連線。隱藏 VPN 或虛擬位址，免得配對時出現它們。

source: The listen address is already in use. Another server may be running.
zh_hans: 监听地址已被占用，可能有别的服务器在运行。
zh_hant: 監聽位址已被占用，可能有別的伺服器在執行。

source: The offline test contact passes messages between this Mac and the phone. Nothing is ever delivered.
zh_hans: 离线测试联系人只在这台 Mac 和手机之间传递消息，不会真的发出去。
zh_hant: 離線測試聯絡人只在這台 Mac 和手機之間傳遞訊息，不會真的傳出去。

source: The running backend opens chat.db with immutable=1, so it predates the malformed-database fix. Restart it with the latest backend.
zh_hans: 运行中的后端以 immutable=1 打开 chat.db，版本早于数据库损坏修复。请用最新后端重启。
zh_hant: 執行中的後端以 immutable=1 開啟 chat.db，版本早於資料庫損壞修正。請用最新後端重新啟動。

source: The running server doesn't report its build, so it predates v0.15 and lacks recent sync fixes. Restart it with the latest backend.
zh_hans: 运行中的服务器不报告版本，说明早于 v0.15，缺少近期的同步修复。请用最新后端重启。
zh_hant: 執行中的伺服器不回報版本，表示早於 v0.15，缺少近期的同步修正。請用最新後端重新啟動。

source: The selected backend (%@) doesn't report a version, so it predates v0.15 and lacks recent sync fixes. Rebuild it with MicaGoServer/micago-server/scripts/build-backend.sh
zh_hans: 所选后端（%@）不报告版本，说明早于 v0.15，缺少近期的同步修复。请用 MicaGoServer/micago-server/scripts/build-backend.sh 重新构建。
zh_hant: 所選後端（%@）不回報版本，表示早於 v0.15，缺少近期的同步修正。請用 MicaGoServer/micago-server/scripts/build-backend.sh 重新建置。

source: The server configuration is missing or invalid (~/.micago/config.yaml).
zh_hans: 服务器配置缺失或无效（~/.micago/config.yaml）。
zh_hant: 伺服器設定遺失或無效（~/.micago/config.yaml）。

source: The server is up but rejected the token. Check %@.
zh_hans: 服务器在运行，但拒绝了令牌。请检查 %@。
zh_hant: 伺服器在執行，但拒絕了權杖。請檢查 %@。

source: The tunnel answered, but no server is behind it (%lld). Make sure micaGO is running and the tunnel forwards to its port.
zh_hans: 隧道有响应，但后面没有服务器（%lld）。请确认 micaGO 正在运行，并且隧道转发到它的端口。
zh_hant: 通道有回應，但後面沒有伺服器（%lld）。請確認 micaGO 正在執行，並且通道轉送到它的連接埠。

source: These rules override the default policy for one chat or handle. Chat rules win over handle rules, and both win over the default.
zh_hans: 这些规则会覆盖某个聊天或地址的默认策略。聊天规则优先于地址规则，两者都优先于默认策略。
zh_hant: 這些規則會覆蓋某個聊天或地址的預設原則。聊天規則優先於地址規則，兩者都優先於預設原則。

source: This build of micaGO doesn’t include the IMCore helper, so it can’t be installed automatically. Edit, Unsend, and Delete stay hidden until you install a build that includes it.
zh_hans: 这个 micaGO 版本没有附带 IMCore 助手，无法自动安装。装上附带助手的版本前，编辑、撤回和删除会一直隐藏。
zh_hant: 這個 micaGO 版本沒有附帶 IMCore 輔助程式，無法自動安裝。裝上附帶輔助程式的版本前，編輯、收回和刪除會一直隱藏。

source: This file stays on the Mac. The server uses it to send pushes.
zh_hans: 这个文件只留在 Mac 上，服务器用它发送推送。
zh_hant: 這個檔案只留在 Mac 上，伺服器用它傳送推播。

source: Token
zh_hans: 令牌
zh_hant: 權杖

source: Toolchain
zh_hans: 工具链
zh_hant: 工具鏈

source: Tutorials
zh_hans: 教程
zh_hant: 教學

source: Type
zh_hans: 类型
zh_hant: 類型

source: Unavailable.
zh_hans: 不可用。
zh_hant: 無法使用。

source: Unexpected response from the server.
zh_hans: 服务器返回了意外的响应。
zh_hant: 伺服器回傳了非預期的回應。

source: Uninstall helper
zh_hans: 卸载助手
zh_hant: 解除安裝輔助程式

source: Unknown
zh_hans: 未知
zh_hant: 未知

source: Unknown sender
zh_hans: 未知发送者
zh_hant: 未知傳送者

source: Unsend / retract
zh_hans: 撤回
zh_hant: 收回

source: Unsent / retracted
zh_hans: 已撤回
zh_hant: 已收回

source: Unsupported
zh_hans: 不支持
zh_hant: 不支援

source: Unsupported reason
zh_hans: 不支持的原因
zh_hant: 不支援的原因

source: Unsupported type
zh_hans: 不支持的类型
zh_hant: 不支援的類型

source: User guides on GitHub open in your browser.
zh_hans: GitHub 上的使用指南会在浏览器中打开。
zh_hant: GitHub 上的使用指南會在瀏覽器中開啟。

source: Using %@ binary: %@
zh_hans: 使用 %@ 程序：%@
zh_hant: 使用 %@ 程式：%@

source: Validate Public URL
zh_hans: 验证公网 URL
zh_hant: 驗證公開 URL

source: Validation failed (HTTP %lld).
zh_hans: 验证失败（HTTP %lld）。
zh_hant: 驗證失敗（HTTP %lld）。

source: Verify TLS certificate
zh_hans: 验证 TLS 证书
zh_hant: 驗證 TLS 憑證

source: Version
zh_hans: 版本
zh_hant: 版本

source: Video
zh_hans: 视频
zh_hant: 影片

source: Voice
zh_hans: 语音
zh_hant: 語音

source: Will not auto-restart: Full Disk Access is required.
zh_hans: 不会自动重启：需要完全磁盘访问权限。
zh_hant: 不會自動重新啟動：需要完整磁碟取用權限。

source: active (%@)
zh_hans: 已启用（%@）
zh_hant: 已啟用（%@）

source: active (power assertion)
zh_hans: 已开启（电源断言）
zh_hant: 已開啟（電源斷言）

source: available
zh_hans: 可用
zh_hant: 可用

source: candidates: %@
zh_hans: 候选：%@
zh_hant: 候選：%@

source: chat.db / WAL / SHM mtime
zh_hans: chat.db / WAL / SHM 修改时间
zh_hant: chat.db / WAL / SHM 修改時間

source: chat.db open
zh_hans: chat.db 打开方式
zh_hant: chat.db 開啟方式

source: config invalid (fcm)
zh_hans: 配置无效（fcm）
zh_hant: 設定無效（fcm）

source: configured
zh_hans: 已配置
zh_hant: 已設定

source: configured (fcm)
zh_hans: 已配置（fcm）
zh_hant: 已設定（fcm）

source: default policy
zh_hans: 默认策略
zh_hant: 預設原則

source: disabled
zh_hans: 已关闭
zh_hant: 已關閉

source: enabled
zh_hans: 已开启
zh_hant: 已開啟

source: google-services.json already configured
zh_hans: google-services.json 已配置
zh_hant: google-services.json 已設定

source: hidden from pairing
zh_hans: 配对时隐藏
zh_hant: 配對時隱藏

source: last: %@
zh_hans: 最近：%@
zh_hant: 最近：%@

source: macOS manages Contacts access. Open System Settings → Privacy & Security → Contacts and turn on micaGO Companion. Without it, contact names may not show, but chats still work with phone numbers or email addresses.
zh_hans: 通讯录权限由 macOS 管理。打开“系统设置 → 隐私与安全性 → 通讯录”，打开 micaGO Companion。没有权限时联系人名字可能不显示，但聊天仍可用号码或邮箱正常收发。
zh_hant: 聯絡人權限由 macOS 管理。打開「系統設定 → 隱私權與安全性 → 聯絡人」，開啟 micaGO Companion。沒有權限時聯絡人名字可能不顯示，但聊天仍可用號碼或電子郵件正常收發。

source: micaGO can't read the Messages database. Give micaGO Companion Full Disk Access, then start the server again.
zh_hans: micaGO 读不到信息数据库。请给 micaGO Companion 完全磁盘访问权限，然后重新启动服务器。
zh_hant: micaGO 讀不到訊息資料庫。請給 micaGO Companion 完整磁碟取用權限，然後重新啟動伺服器。

source: micaGO listens on your local network so devices on the same Wi‑Fi can connect. This applies to the server Companion starts.
zh_hans: micaGO 在局域网上监听，让同一 Wi‑Fi 下的设备能连上。这里的设置用于 Companion 启动的服务器。
zh_hant: micaGO 在區域網路上監聽，讓同一 Wi‑Fi 下的裝置能連上。這裡的設定用於 Companion 啟動的伺服器。

# mode: %@, push: %@, background: %@
source: mode: %1$@, push: %2$@, background: %3$@
zh_hans: 方式：%@，推送：%@，后台：%@
zh_hant: 方式：%@，推播：%@，背景：%@

source: no
zh_hans: 否
zh_hant: 否

source: not running
zh_hans: 未运行
zh_hant: 未執行

source: not set
zh_hans: 未设置
zh_hant: 未設定

source: off
zh_hans: 关闭
zh_hant: 關閉

source: running
zh_hans: 运行中
zh_hant: 執行中

source: seen: %@
zh_hans: 最后活动：%@
zh_hant: 最後活動：%@

# settings.app.hideDockIcon
source: Hide Dock icon when running in menu bar
zh_hans: 菜单栏运行时隐藏 Dock 图标
zh_hant: 選單列執行時隱藏 Dock 圖示

# settings.app.launchHidden
source: Launch hidden
zh_hans: 启动时隐藏窗口
zh_hant: 啟動時隱藏視窗

# settings.developer.disable
source: Disable
zh_hans: 关闭
zh_hant: 關閉

# settings.developer.enable
source: Enable
zh_hans: 开启
zh_hant: 開啟

# settings.developer.enabled
source: Developer mode is enabled
zh_hans: 开发者模式已开启
zh_hant: 開發者模式已開啟

# settings.developer.help
source: Shows Debug and Log in the sidebar.
zh_hans: 在侧栏显示调试和日志。
zh_hant: 在側欄顯示除錯和日誌。

# settings.developer.off
source: Developer mode is off
zh_hans: 开发者模式已关闭
zh_hant: 開發者模式已關閉

# settings.developer.title
source: Developer Mode
zh_hans: 开发者模式
zh_hant: 開發者模式

# settings.general.title
source: General Settings
zh_hans: 通用设置
zh_hant: 一般設定

# settings.login.startAtLogin
source: Start micaGO Companion when I log in
zh_hans: 登录时启动 micaGO Companion
zh_hant: 登入時啟動 micaGO Companion

# settings.login.status
source: Status
zh_hans: 状态
zh_hant: 狀態

# settings.server.lifecycleWithApp
source: Start and stop server with micaGO Companion
zh_hans: 随 micaGO Companion 启动和退出服务端
zh_hant: 隨 micaGO Companion 啟動和結束服務端

# settings.server.restartHelp
source: Auto-restart uses backoff and stops after repeated crashes.
zh_hans: 自动重启会在连续崩溃后停止。
zh_hant: 自動重啟會在連續當機後停止。

# settings.server.restartOnCrash
source: Restart server if it crashes
zh_hans: 崩溃后自动重启服务端
zh_hant: 當機後自動重啟服務端

source: since: %@
zh_hans: 连接于：%@
zh_hant: 連線於：%@

source: sync: %@
zh_hans: 同步：%@
zh_hant: 同步：%@

source: unavailable
zh_hans: 不可用
zh_hant: 無法使用

source: yes
zh_hans: 是
zh_hant: 是

source: · %lld contacts
zh_hans: · %lld 位联系人
zh_hant: · %lld 位聯絡人

source: · %lld unsupported
zh_hans: · %lld 条不支持
zh_hant: · %lld 則不支援

source: “Sender & message” puts the message text in the push, which goes through Google FCM. Pick “Sender only” or “None” to keep message text off Google's servers.
zh_hans: “发送者和消息”会把消息内容放进推送，经由 Google FCM 发送。不想让消息内容经过 Google 服务器，请选“仅发送者”或“无”。
zh_hant: 「傳送者和訊息」會把訊息內容放進推播，經由 Google FCM 傳送。不想讓訊息內容經過 Google 伺服器，請選「僅傳送者」或「無」。

source: • micaGO has no cloud server. You use your own Firebase project. • Firebase is only used for Android push and the optional public URL lookup. • Windows clients get notifications over WebSocket while they run. Huawei/HarmonyOS push isn't supported yet, and iOS push isn't planned. • Firebase never stores message content, contacts, phone numbers, tokens, attachments, chat history, the device list, or sync rules. • A push only carries delivery data. Message history still syncs over your normal micaGO connection.
zh_hans: • micaGO 没有云端服务器，你用的是自己的 Firebase 项目。 • Firebase 只用于安卓推送和可选的公网 URL 查询。 • Windows 客户端运行时通过 WebSocket 接收通知。暂不支持华为/鸿蒙推送，也没有 iOS 推送计划。 • Firebase 不会存储消息内容、联系人、电话号码、令牌、附件、聊天记录、设备列表或同步规则。 • 推送只携带送达信息，消息记录仍通过你平常的 micaGO 连接同步。
zh_hant: • micaGO 沒有雲端伺服器，你用的是自己的 Firebase 專案。 • Firebase 只用於 Android 推播和選用的公開 URL 查詢。 • Windows 用戶端執行時透過 WebSocket 接收通知。暫不支援華為/鴻蒙推播，也沒有 iOS 推播計畫。 • Firebase 不會儲存訊息內容、聯絡人、電話號碼、權杖、附件、聊天記錄、裝置列表或同步規則。 • 推播只攜帶送達資訊，訊息記錄仍透過你平常的 micaGO 連線同步。

source: New pairing code
zh_hans: 生成新配对码
zh_hant: 產生新配對碼

source: Pairing code
zh_hans: 配对码
zh_hant: 配對碼

source: Pairing code expires after 5 minutes and can be used once.
zh_hans: 配对码五分钟有效，仅可使用一次。
zh_hant: 配對碼五分鐘內有效，僅可使用一次。

source: Create a new pairing code to connect a device.
zh_hans: 请生成新配对码以连接设备。
zh_hant: 請產生新配對碼以連線裝置。
